/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ten_queens_puzzle.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sebang <sebang@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/19 18:01:24 by sebang            #+#    #+#             */
/*   Updated: 2023/01/19 22:52:04 by sebang           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_ten_queens_puzzle(void);

int queens()
int	ft_ten_queens_puzzle(void)
{
//재귀는 설계 끝내고 짜면 백발백중
//설계하기전에 코딩하면 손 낭비
}